<?php

namespace Database\Seeders;

use App\Models\Buffet;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BuffetSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Buffet::factory(7)->create();

        // Buffet::factory()->create([
        //     'name' => 'بوفيه حلويات  بروفيشنال',
        //     'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
        //     'type' => 'حلو',
        //     'image' => 'https://via.placeholder.com/640x480.png/00eedd?text=qui',
        //     'price' => 30.0000,
        //     'category_id' => 3,

        // ]);
        // DB::table('buffets')->delete();
        Buffet::query()->delete();
        $buffets = [
            [
                'name' => 'بوفيه حلويات  ملكي', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'شرقي',
                'image' => 'بوفيه حلويات  ملكي.png',
                'price' => 300000,
                'category_id' => 3,
            ],
            [
                'name' => 'بوفيه حلويات  بروفيشنال', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غربي',
                'image' => 'بوفيه حلويات  بروفيشنال.png',
                'price' => 300000,
                'category_id' => 3,
            ],
            [
                'name' => 'بوفيه حلويات  مودرن', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'شرقي',
                'image' => 'بوفيه حلويات  مودرن.png',
                'price' => 300000,
                'category_id' => 3,
            ],
            [
                'name' => 'بوفيه حلويات  بروفيشنال', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غربي',
                'image' => 'بوفيه حلويات  بروفيشنال .png',
                'price' => 300000,
                'category_id' => 3,
            ],
            [
                'name' => 'بوفيه حلويات  مميز', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غربي',
                'image' => 'بوفيه حلويات  مميز.png',
                'price' => 300000,
                'category_id' => 3,
            ],
            [
                'name' => 'فطور عربي ملكي', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'فطور',
                'image' => 'فطور عربي ملكي.png',
                'price' => 300000,
                'category_id' => 1,
            ],
            [
                'name' => 'بوفيه عشاء فاخر', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غداء',
                'image' => 'بوفيه عشاء فاخر.png',
                'price' => 30.0000,
                'category_id' => 1,
            ],
            [
                'name' => 'بوفيه  غداء فاخر', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غداء',
                'image' => 'بوفيه  غداء فاخر.png',
                'price' => 30.0000,
                'category_id' => 1,
            ],
            [
                'name' => 'بوفيه غداء فاخر',  'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غداء',
                'image' => 'بوفيه غداء فاخر.png',
                'price' => 30.0000,
                'category_id' => 1,
            ],
            [
                'name' => 'فطور عربي خفيف',  'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'فطور',
                'image' => 'فطور عربي خفيف.png',
                'price' => 30.0000,
                'category_id' => 1,
            ],
            [
                'name' => 'فطور عربي',  'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'فطور',
                'image' => 'فطور عربي .png',
                'price' => 30.0000,
                'category_id' => 1,
            ],
            [
                'name' => 'بوفيه عشاء  فاخر', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غداء',
                'image' => 'بوفيه عشاء  فاخر.png',
                'price' => 30.0000,
                'category_id' => 2,
            ],
            [
                'name' => 'فطور غربي خفيف', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'فطور',
                'image' => 'فطور غربي خفيف.png',
                'price' => 30.0000,
                'category_id' => 2,
            ],
            [
                'name' => 'فطور غربي ملكي', 'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'فطور',
                'image' => 'فطور غربي ملكي.png',
                'price' => 30.0000,
                'category_id' => 2,
            ],
            [
                'name' => 'بوفيه غداء   فاخر',  'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'غداء',
                'image' => 'بوفيه غداء   فاخر.png',
                'price' => 30.0000,
                'category_id' => 2,
            ],
            [
                'name' => 'فطور غربي',  'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
                'type' => 'فطور',
                'image' => 'فطور غربي.png',
                'price' => 30.0000,
                'category_id' => 2,
            ],
            // [
            //     'name' => 'بوفيه عشاء منوع',  'ingredients' => 'كول وشكور , مبرومة , بلورية ,وربات بالقشطة , كنافة , كنافة نابلسية بأنواعها , أم النارين , هريسة بقشطة , هريسة  بأنواعها ,معمول بأنواعه , غريبة بقشطة ',
            //     'type' => 'غداء',
            //     'image' => 'بوفيه عشاء فاخر.png',
            //     'price' => 30.0000,
            //     'category_id' => 2,
            // ],
        ];
        Buffet::insert($buffets);
        //   DB::table('buffets')->insert($buffets);
    }
}
